{
	"1.0":{
		"advice1":"Venti would be a way to go here since klee isnt much of a diversive character. Four stars in this version are also worthy of pulling as they are ones of the greatest supports/subDPS's",
		"advice2":"Childe is a good DPS and Zhongli is a good shielder, both worth pulling",
		"advice3":"Overall since Venti is a support he would be used in bigger amount of teams than anyone else, but Childe is pretty diversive too, so pick out of them"
	},
	"1.1":{
		"advice1":"Both Zhongli and Childe are great, since its only the start of the game, DPS would be more valueable at the moment, so i would reccomend going for Childe",
		"advice2":"Albedo is a geo support and ganyu is a pretty good cryo DPS. Four stars here is a must to have. Out of them i would reccoment going for Ganyu as she has great dmg scaling and generally would be more usefull",
		"advice3":"You will have to pick out of two DPS characters, Ganyu and Childe. Hydro reactions have more DMG, so i would reccoment going for Childe here"
	},
	"1.2":{
		"advice1":"Since Albedo is more of a specifically used support and will not be used by player in endgame, Ganyu (as a more diversive character) would be a better choice here as she remains useful even in endgame",
		"advice2":"Xiao and Hutao are both very strong DPS and both need quite a time to build, go with the one you like the most. Four stars on Hutao's banner are great as well",
		"advice3":"Overall i would reccomend going for Xiao, Ganyu or Hutao as they are strong DPS characters and going to remain this way for a long time"
	},
	"1.3":{
		"advice1":"Xiao and Hutao are both very strong DPS and both need quite a time to build, go with the one you like the most. Four stars on Hutao's banner are great as well",
		"advice2":"Out of Childe and Venti pick anyone, they both will be very helpful for a long time",
		"advice3":"Overall you will need to pick out of Hutao, Childe and Xiao as DPS, and then Venti as support. Everyone here is great, pick whoever you simp for more ;]"
	},
	"1.4":{
		"advice1":"Out of Childe and Venti pick anyone, they both will be very helpful for a long time",
		"advice2":"Zhongli and Eula. Eula is not diversive and needs quite an investment, at the same time Zhongli (as a shielder) needs to be flooded with HP and will be used by player for years",
		"advice3":"Venti and Zhongli are great supports and childe is a good DPS. If you dont lack doging skills - skip Zhongli and go either for Venti(good crowd controll and element spreading) or Childe (Hydro is a good element with a variety of reactions)"
	},
	"1.5":{
		"advice1":"Zhongli and Eula. Eula is not diversive and needs quite an investment, at the same time Zhongli (as a shielder) needs to be flooded with HP and will be used by player for years",
		"advice2":"Klee and Kazuha. Kazuha is the best anemo support, he not only provides crowd controll but also buffs your team a tonn. He would be the best pull choice here",
		"advice3":"Overall Kazuha is the most powerfulll and diversive character here"
	},
	"1.6":{
		"advice1":"Klee and Kazuha. Kazuha is the best anemo support, he not only provides crowd controll but also buffs your team a tonn. He would be the best pull choice here",
		"advice2":"Ayaka and Yoimiya. Yoimiya can only be a DPS surrounded by supports, Ayaka here is a little more diversive. Better pull for Ayaka",
		"advice3":"Overall Kazuha would be your first priority, then comes Ayaka and Yoimiya"
	},
	"2.0":{
		"advice1":"Ayaka and Yoimiya. Yoimiya can only be a DPS surrounded by supports, Ayaka here is a little more diversive. Better pull for Ayaka",
		"advice2":"Raiden and Kokomi. Both are great characters. Kokomi can be used in alot of teams as a hydro applier and healer, Raiden is a very strong character, can be used as DPS, electro applier. If you are confident about your dodging skills or you already have a healer/shielder - go for raiden",
		"advice3":"Overall Raiden would be a top one priority for you, followed by Kokomi, then Ayaka and Yoimiya"
	},
	"2.1":{
		"advice1":"Raiden and Kokomi. Both are great characters. Kokomi can be used in alot of teams as a hydro applier and healer, Raiden is a very strong character, can be used as DPS, electro applier. If you are confident about your dodging skills or you already have a healer/shielder - go for raiden",
		"advice2":"Childe and Hutao. Both ae great DPS characters, though Hutao would be dealing more DMG and Childe will fit in more teams",
		"advice3":"Overall Raiden would be the strongest character, but feel free to pull for whoever you want here. everyone is good"
	},
	"2.2":{
		"advice1":"Childe and Hutao. Both ae great DPS characters, though Hutao would be dealing more DMG and Childe will fit in more teams",
		"advice2":"Albedo, Eula and Itto. Out of all three Itto would be first prioity, everyone else doesnt worth wasting resourses (if you are not specifically going for phisical team or just want to use Albedo)",
		"advice3":"Overall look what team you want to build. Hutao for Pyro based team, Childe for Hydro and Itto for Geo. I would reccomend going for Childe"
	},
	"2.3":{
		"advice1":"Albedo, Eula and Itto. Out of all three Itto would be first prioity, everyone else doesnt worth wasting resourses (if you are not specifically going for phisical team or just want to use Albedo)",
		"advice2":"Shenhe, Xiao, Zhongli, Ganyu. Shenhe is your last option, only pull for her out of love for some Cryo DPS you already have built. If you have a decent healer or you dodge well and dont want a Geo team - skip Zhongli as well. Now you choose between Xiao and Ganyu, Ganyu is a bit easier to build and use. But if you dont care bout difficulties - go for whoever you want out of those two",
		"advice3":"Overall your best options are Xiao and Ganyu followed by Itto for mono Geo team"
	},
	"2.4":{
		"advice1":"Shenhe, Xiao, Zhongli, Ganyu. Shenhe is your last option, only pull for her out of love for some Cryo DPS you already have built. If you have a decent healer or you dodge well and dont want a Geo team - skip Zhongli as well. Now you choose between Xiao and Ganyu, Ganyu is a bit easier to build and use. But if you dont care bout difficulties - go for whoever you want out of those two",
		"advice2":"Yae Miko, Raiden and Kokomi. Absolutely everyone is good but Yae needs a shield or good dodging skills",
		"advice3":"Overall Raiden would be your first priority, if you dont want any electro character then go for Xiao, Kokomi or Zhongli"
	},
	"2.5":{
		"advice1":"Yae Miko, Raiden and Kokomi. Absolutely everyone is good but Yae needs a shield or good dodging skills",
		"advice2":"Ayato, Ayaka and Venti. Everyone is pretty much on the same level here. Ayato being a good hydro DPS and a hydro applier",
		"advice3":"Overall everyone is great. Make decision based on your desired team"
	},
	"2.6":{
		"advice1":"Ayato, Ayaka and Venti. Everyone is pretty much on the same level here. Ayato being a good hydro DPS and a hydro applier",
		"advice2":"Yelan, Xiao and Itto. Yelan here is the strongest piece, followed by Xiao. Reccomended to go for Yelan",
		"advice3":"Overall Yelan would be your best choice here, followed by Xiao and then everyone else"
	},
	"2.7":{
		"advice1":"Yelan, Xiao and Itto. Yelan here is the strongest piece, followed by Xiao. Reccomended to go for Yelan",
		"advice2":"Kazuha, Klee and Yoimiya. Kazuha is a top one here for sure, then comes Yoimiya, Klee does not worth it",
		"advice3":"Overall Kazuha and Yelan are the ones to go for"
	},
	"2.8":{
		"advice1":"Kazuha, Klee and Yoimiya. Kazuha is a top one here for sure, then comes Yoimiya, Klee does not worth it",
		"advice2":"Tighnari, Zhongli, Ganyu and Kokomi. With new dendro element, new reactions come, making electro and hydro characters alot stronger. Tighnari's playstyle requires him on field, so to trigger reactions you need an off-filed electro/hydro applier to use Tighnari correctly",
		"advice3":"Since we are getting out first dendro character here and he is quite decent, you could pull for him, especially if you have an off-field applier (hydro, electro), but do not forget about Kazuha as he elevates your accout to a whole new level"
	},
	"3.0":{
		"advice1":"Tighnari, Zhongli, Ganyu and Kokomi. With new dendro element, new reactions come, making electro and hydro characters alot stronger. Tighnari's playstyle requires him on field, so to trigger reactions you need an off-filed electro/hydro applier to use Tighnari correctly",
		"advice2":"Cyno, Venti, Nilou, Albedo. Assuming you already have an anemo character (Sucrose, Venti, Kazuha), your option here would be Cyno or Nilou. I would reccomend pulling for Nilou as at the moment dendro reactions are very good and cheap in use",
		"advice3":"Tighnari would be a very important part of many future updates, so getting Tighnari would be a decent choice, Nilou is a good choice as well as Kokomi (since they are hydro appliers with Nilou even being able to deal some decent hydro DMG)"
	},
	"3.1":{
		"advice1":"Cyno, Venti, Nilou, Albedo. Assuming you already have an anemo character (Sucrose, Venti, Kazuha), your option here would be Cyno or Nilou. I would reccomend pulling for Nilou as at the moment dendro reactions are very good and cheap in use",
		"advice2":"Nahida, Yoimiya, Childe, Yae. Nahida is a great support and DPS, she will work very well with Raiden, Kokomi, Yae etc.",
		"advice3":"Overall Nahida and Nilou are your best options here with Nahida, as i think, being your best options"
	},
	"3.2":{
		"advice1":"Nahida, Yoimiya, Childe, Yae. Nahida is a great support and DPS, she will work very well with Raiden, Kokomi, Yae etc.",
		"advice2":"Scara, Itto, Raiden and Ayato. Scara is a strong DPS but hes a little bit hard to play without his C1 or a shielder. Dont forget how powerful Raiden is though)",
		"advice3":"Nahida, Scara and Raiden here are great. Scara would be working as an anemo DPS accompanied by supports and subDPS (Xingqiu, Yelan, Zhongli)"
	},
	"3.3":{
		"advice1":"Scara, Itto, Raiden and Ayato. Scara is a strong DPS but hes a little bit hard to play without his C1 or a shielder. Dont forget how powerful Raiden is though)",
		"advice2":"Al Haitham, Xiao, Hutao, Yelan. Haitham is the strongest dendro DPS and Yelan is one of the best hydro characters",
		"advice3":"Haitham would be a good option to pull for as he is a great DPS and you should already have a few suitable hydro and electro characters for him, if you dont feel like pulling for him - Yelan is still a great choice"
	},
	"3.4":{
		"advice1":"Al Haitham, Xiao, Hutao, Yelan. Haitham is the strongest dendro DPS and Yelan is one of the best hydro characters",
		"advice2":"Dehya, Cyno, Ayaka and Shenhe. Since Dehya does not really have good scales and she will be added to standard banner which makes her your least wanted option, you already know about Shenhe (cryo support only), so best oprions here are Ayaka and Cyno",
		"advice3":"Haitham would be a good option to pull for as he is a great DPS and you should already have a few suitable hydro and electro characters for him, if you dont feel like pulling for him - Yelan is still a great choice"
	},
	"3.5":{
		"advice1":"Dehya, Cyno, Ayaka and Shenhe. Since Dehya does not really have good scales and she will be added to standard banner which makes her your least wanted option, you already know about Shenhe (cryo support only), so best oprions here are Ayaka and Cyno",
		"advice2":"Nahida, Nilou, Baizhu, Ganyu. Nahida and Nilou here are the best characters, followed by Ganyu and then Baizhu (who i wouldnt reccomend to pull for)",
		"advice3":"Nahida and Nilou are your first tier options here as they are most diversive here, followed by Ganyu, Ayaka and Cyno and then everyone else"
	},
	"3.6":{
		"advice1":"Nahida, Nilou, Baizhu, Ganyu. Nahida and Nilou here are the best characters, followed by Ganyu and then Baizhu (who i wouldnt reccomend to pull for)",
		"advice2":"Yoimiya, Yae Miko, Kazuha and Haitham. Haitham and Kazuha here are the best, since current version is all about dendro reactions, Haitham would be a smarter choice",
		"advice3":"Everyone except Yae and Baizhu would be a good choice here"
	},
	"3.7":{
		"advice1":"Yoimiya, Yae Miko, Kazuha and Haitham. Haitham and Kazuha here are the best, since current version is all about dendro reactions, Haitham would be a smarter choice",
		"advice2":"Klee, Eula, Scara, Kokomi. Scara or Kokomi here are good, with Kokomi being a good healer and off-field hydro applier, Scara needs some supports and off-field subDPS",
		"advice3":"Klee, Eula and Yoimiya here dont really deserve your attention if you still dont have 2-4 complete teams"
	},
	"3.8":{
		"advice1":"Klee, Eula, Scara, Kokomi. Scara or Kokomi here are good, with Kokomi being a good healer and off-field hydro applier, Scara needs some supports and off-field subDPS",
		"advice2":"Leney, Yelan, Childe and Zhongli. New character, Leney has a questionable gameplay, therefore your options here would be anyone else, if you never pulled for shielder - it might be a right time to pull for Zhongli)",
		"advice3":"Yelan being first priority, followed by Childe, Zhongli and Kokomi"
	},
	"4.0":{
		"advice1":"Leney, Yelan, Childe and Zhongli. New character, Leney has a questionable gameplay, therefore your options here would be anyone else, if you never pulled for shielder - it might be a right time to pull for Zhongli)",
		"advice2":"Neuvillette, Hutao, Wriothesley, Venti. Obvious choice here is Neuvillette as he is the strongest and easy to play hydro DPS",
		"advice3":"Neuvillette is the best option here, he is extremely strong"
	},
	"4.1":{
		"advice1":"Neuvillette, Hutao, Wriothesley, Venti. Obvious choice here is Neuvillette as he is the strongest and easy to play hydro DPS",
		"advice2":"Furina, Baizhu, Cyno, Ayato. Rurina is your best option here as she is a very good hydro support, off-field dubDPS, healer. Pull Furina here",
		"advice3":"Neuvillette and Furina are your best options here"
	},
	"4.2":{
		"advice1":"Furina, Baizhu, Cyno, Ayato. Rurina is your best option here as she is a very good hydro support, off-field dubDPS, healer. Pull Furina here",
		"advice2":"Navia, Ayaka, Raiden, Yoimiya. Here i would reccomend to choose between Navia and Raiden, if you already have nay strong electro piece - go for Navia as shes a very strong andcheap character to build",
		"advice3":"Navia and Furina are both great options here. Furina is more diversive but if you still dont have a geo team by now - you should consider pulling for Navia here"
	},
	"4.3":{
		"advice1":"Navia, Ayaka, Raiden, Yoimiya. Here i would reccomend to choose between Navia and Raiden, if you already have nay strong electro piece - go for Navia as shes a very strong andcheap character to build",
		"advice2":"Xianyun, Nahida, Xiao, Yae. Xianyun is only gonna be useful in specific situations, not good for all characters, so its better to pull Nahida as she is more diversive",
		"advice3":"If you still dont have a geo team by now - you should consider pulling for Navia, Raiden and Nahida are still very good for a dendro based reaction teams, Yoimiya would be a good starter character as shes an easy character to play"
	},
	"4.4":{
		"advice1":"Xianyun, Nahida, Xiao, Yae. Xianyun is only gonna be useful in specific situations, not good for all characters, so its better to pull Nahida as she is more diversive",
		"advice2":"Chiori, Itto, Neuvillette, Kazuha. Chiori is a decent character but not the best choice here as shes just a geo support, so if you dont have a dedicated geo team she would be better to skip. Itto is a decent option here if you still have no geo team. Neuvillette and kazuha are both great, they would be your best options here",
		"advice3":"Neuvillette, Kazuha and Nahida would be the most diversive ones here, just go for them"
	},
	"4.5":{
		"advice1":"Chiori, Itto, Neuvillette, Kazuha. Chiori is a decent character but not the best choice here as shes just a geo support, so if you dont have a dedicated geo team she would be better to skip. Itto is a decent option here if you still have no geo team. Neuvillette and kazuha are both great, they would be your best options here",
		"advice2":"Arlechino, Leney, Scara and Baizhu. Here Arlechino i think is the best option, she is pretty strong, has an interesting playstyle and fast to build, having good weapon choices even around 3 stars weapons",
		"advice3":"Arlechino and Neuvillette are both very strong, i would be reccomending going for them, both are not as hard to build so choice is all about Pyro or Hydro"
	},
	"4.6":{
		"advice1":"Arlechino, Leney, Scara and Baizhu. Here Arlechino i think is the best option, she is pretty strong, has an interesting playstyle and fast to build, having good weapon choices even around 3 stars weapons",
		"advice2":"Sigewinne, Clorinde ..... Sigewinne is going to be a hydro healer and Clorinde is an electro DPS (more information incoming later)",
		"advice3":"Arlechino and Clorinde seems to be good options to pull for (not enough information)"
	}
}